Revit 2026 API

# CurveElementCreateAreaBasedLoadBoundaryLines Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<CurveElement> CreateAreaBasedLoadBoundaryLines(
	Document document,
	IList<Curve> curves,
	ElementId levelId
)
```
```vb
Public Shared Function CreateAreaBasedLoadBoundaryLines (
	document As Document,
	curves As IList(Of Curve),
	levelId As ElementId
) As IList(Of CurveElement)
```
```cpp
public:
static IList<CurveElement^>^ CreateAreaBasedLoadBoundaryLines(
	Document^ document,
	IList<Curve^>^ curves,
	ElementId^ levelId
)
```
```fsharp
static member CreateAreaBasedLoadBoundaryLines :
        document : Document *
        curves : IList<Curve> *
        levelId : ElementId -> IList<CurveElement>
```

#### Parameters

document Document

curves IListCurve

levelId ElementId

#### Return Value

IListCurveElement

#### Reference

CurveElement Class

Autodesk.Revit.DB Namespace